app/controllers/clients_controller.rb

SELECT * FROM "dicts" WHERE (category ='client_status')
SELECT count(*) AS count_all FROM "clients"
SELECT * FROM "clients" ORDER BY english_name LIMIT 20 OFFSET 0
---
  def index
    @statuses = Dict.find(:all,
      :conditions =>"category ='client_status'")

     @client = Client.new(params[:client])
    sql = "1"
     sql += " and client_code like '%"+@client.client_code+"%' " if @client.client_code
     sql += " and chinese_name like '%"+@client.chinese_name+"%' " if @client.chinese_name
    if !@client.client_code.empty?
      #@clients = Client.find(:all,
      #                      :conditions => ['client_code like ?', @client.client_code])
      @clients = Client.find(:all,:conditions=>sql).paginate :page => params[:page], :per_page => 20, :order => 'english_name'
    else
      @clients  = Client.paginate :page => params[:page], :per_page => 20, :order => 'english_name'