app/controllers/expenses_controller.rb

  def index

    order_str =" expenses.updated_at desc "
    sql =" 1 "
    sql += " and expense_category like '%#{params[:expense_category].strip}%' "  if params[:expense_category].present?
    #sql += " and projects.job_code like '%#{params[:job_code].strip}%' "  if params[:job_code].present?
    sql += " and project_id=#{params[:prj_id]}"       if params[:prj_id].present?
    sql += " and clients.english_name like '%#{params[:client_name].strip}%' "  if params[:client_name].present?
    sql += " and charge_date <= '#{params[:end_date]}'" if params[:end_date].present?
    sql += " and charge_date >= '#{params[:start_date]}'" if params[:start_date].present?
    sql += " and expenses.person_id = #{params[:person_id]}" if params[:person_id].present?
    sql += " and expenses.state = '#{params[:state]}'" if params[:state].present?
    session[:expense_sql] =sql

     if current_user.roles == "providence_breaker"
      expenses = Expense.find(:all,:conditions=>sql, :order=>"expenses.state, projects.job_code", :include=>:project)
---
SELECT "expenses".* FROM "expenses" left join projects on project_id = projects.id left join clients on client_id = clients.id WHERE ( 1 ) ORDER BY expenses.charge_date desc,expenses.state desc
SELECT * FROM "projects" WHERE (1) ORDER BY job_code