app/controllers/homepage_controller.rb

  def index
    if logged_in?
    if current_user.roles == 'providence_breaker'
      @projects = Project.find(:all)
---
SELECT * FROM "projects" WHERE (1) ORDER BY projects.created_on