app/controllers/personalcharges_controller.rb

  def index

    sql = " 1 "
    sql += " and person_id=#{params[:person_id]}"     if params[:person_id].present?
    sql += " and state = '#{params[:state]}'"       if params[:state].present?
    sql += " and periods.starting_date >= '#{params[:period_from]}' "   if params[:period_from].present?
    sql += " and periods.ending_date   <= '#{params[:period_to]}' "     if params[:period_to].present?
    sql += " and project_id=#{params[:prj_id]}"       if params[:prj_id].present?
    if params[:role].present?
      case params[:role]
      when "Director":
          projects = Project.find(:all, :conditions=>"partner_id = #{current_user.person_id}")
        managers_id =""
        projects.each{|p| managers_id += (p.manager.id.to_s + ",") unless p.manager.nil?}
        managers_id += "0"
        sql += " and personalcharges.person_id in (#{managers_id})"
      when "Manager":
          sql += " and projects.manager_id = #{current_user.person_id}"
      when "Member":
          sql += " and personalcharges.person_id = #{current_user.person_id}"
      end
    end
    if current_user.roles == "providence_breaker"
      personalcharges = Personalcharge.find(:all,:conditions=>sql, :order=>"projects.job_code", :include=>:project)
---
SELECT * FROM "projects" WHERE (1) ORDER BY projects.created_on
SELECT * FROM "projects"
SELECT "personalcharges".* FROM "personalcharges" left join projects on personalcharges.project_id = projects.id left join periods on personalcharges.period_id = periods.id left join people on personalcharges.person_id = people.id WHERE ( 1 ) ORDER BY personalcharges.charge_date desc,personalcharges.created_on desc,people.english_name, periods.number, projects.job_code, personalcharges.hours,personalcharges.state desc