app/controllers/projects_controller.rb

  def index
    @project = Project.new(params[:project])
    @client = Client.new(params[:client])

    sql = ' 1 '
    sql += " and clients.english_name like '%#{@client.english_name}%' " if @client.english_name.present?
    sql += " and partner_id = #{@project.partner_id} " if @project.partner_id.present?
---
SELECT * FROM "projects" WHERE ( 1 ) ORDER BY projects.created_on desc