app/controllers/users_controller.rb

  def create
    #logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO "users" ("remember_token_expires_at", "email", "created_at", "name", "remember_token", "person_id", "login", "crypted_password", "salt", "updated_at", "roles") VALUES(NULL, 'wangkun025@gmail.com', '2014-10-27 14:43:00', '', NULL, 0, 'ken', 'f5679294804d2e86135ec65e0c712da4467f6720', '13ec830c51d2f42843f5e89a8db2c8ece30aee1e', '2014-10-27 14:43:00', 'employee')